<section class="scheme">
  <div class="container">
    <h2 class="section__title">Простая схема работ</h2>
    установите себе новые окна за 24 часа

    <div class="scheme__steps">
      <ul>
        <li>
          <h3>Приём заказа</h3>
          Оставьте заявку по телефону: 8 (800) 555-15-49 или на сайте
        </li>
        <li>
          <h3>Замер окон</h3>
          Замерщик выезжает по адресу для замера Ваших окон
        </li>
        <li>
          <h3>Расчет стоимости</h3>
          Рассчитываем стоимость и оформляем договор
        </li>
        <li>
          <h3>Производство</h3>
          Мы производим окна под ваши размеры, от 5 до 7 рабочих дней
        </li>
        <li>
          <h3>Бесплатная доставка</h3>
          Привозим окна и устанавливаем, вы наслаждаетесь результатом
        </li>
      </ul>
    </div>
  </div>
</section>