<div class="kbe">

	<div class="container">
		<p>Наша компания «ОкнаМобифон» представляет своим клиентам популярные пластиковые окна KBE от прямых производителей, в большом ассортименте и по самым
			доступным ценам в Москве и Московской области. Несмотря на то, что каталог брендов у нас большой, именно готовые пвх окна от немецкого бренда KBE
			пользуются наибольшим спросом. Они отличаются повышенными свойствами, подойдут для каждого помещения, просты в установке, есть большой выбор, из-за
			чего каждый сможет найти подходящий вариант как по цене, так и параметрам (ширине и высоте, а также толщине стеклопакета).</p>


	</div>

</div>

<section class="kbe-types">
	<div class="container">
		<h2 class="section__title">Разновидности пластиковых окон KBE</h2>

		<ul class="section-tabs">
			<li>Engine</li>
			<li>Etalon</li>
			<li>Energy</li>
			<li>Master</li>
			<li>Expert</li>
		</ul>


		<div class="kbe-types__items">

			<section class="card kbe-types__item">
				<div>
					<img src="<?= get_theme_file_uri( 'assets/img/pages/kbe/kbe-engine.png' ); ?>" alt="">
					<div class="kbe-types__item-title">
						<h3>KBE Engine</h3>
						<p>Профиль Engine позволяет пропускать на 3 % больше естественного света, чем другие. За счёт трёхкамерной структуры окна КБЕ не
							замерзают
							зимой и летом!</p>
					</div>
				</div>
				<div>
					<h4>Характеристики</h4>

					<ul>
						<li>Количество камер 3</li>
						<li>Толщина стенок 2.8 мм</li>
						<li>Толщина рамы 58 мм</li>
						<li>Толщина стеклопакета до 34 мм</li>
						<li>Цвет уплотнителя серый, черный</li>
					</ul>

					<div class="kbe-types__price">от 4 600 руб / м²</div>
				</div>
			</section>

			<section class="card kbe-types__item">
				<div>
					<img src="<?= get_theme_file_uri( 'assets/img/pages/kbe/kbe-engine.png' ); ?>" alt="">
					<div class="kbe-types__item-title">
						<h3>KBE Etalon</h3>
						<p>Профиль Etalon подходит для остекления любого помещения, благодаря монтажной глубине конструкции 58 мм. Это позволяет устанавливать
							двухкамерные стеклопакеты до 34м и защищать от шума с улицы, продукция дает в два раза больше тепла. Базовая комплектация
							предполагает
							серый
							или черный уплотнительный контур.</p>
					</div>
				</div>
				<div>
					<h4>Характеристики</h4>

					<ul>
						<li>Количество камер 3</li>
						<li>Толщина стенок 2.8 мм</li>
						<li>Толщина рамы 58 мм</li>
						<li>Толщина стеклопакета до 34 мм</li>
						<li>Цвет уплотнителя серый, черный</li>
					</ul>

					<div class="kbe-types__price">от 5 250 руб / м²</div>
				</div>
			</section>

			<section class="card kbe-types__item">
				<div>
					<img src="<?= get_theme_file_uri( 'assets/img/pages/kbe/kbe-engine.png' ); ?>" alt="">
					<div class="kbe-types__item-title">
						<h3>KBE Energy</h3>
						<p>В качестве альтернативы профилю Expert от производителя KBE предлагается трёхкамерное исполнение. Платформа шириной 70 мм позволяет
							установить двух камерный стеклопакет до 42 см и увеличить ширину монтажного шва на 20%.</p>
					</div>
				</div>
				<div>
					<h4>Характеристики</h4>

					<ul>
						<li>Количество камер 3</li>
						<li>Толщина стенок 2.8 мм</li>
						<li>Толщина рамы 58 мм</li>
						<li>Толщина стеклопакета до 34 мм</li>
						<li>Цвет уплотнителя серый, черный</li>
					</ul>

					<div class="kbe-types__price">от 5 350 руб / м²</div>
				</div>
			</section>

			<section class="card kbe-types__item">
				<div>
					<img src="<?= get_theme_file_uri( 'assets/img/pages/kbe/kbe-engine.png' ); ?>" alt="">
					<div class="kbe-types__item-title">
						<h3>KBE Master</h3>
						<p>Профиль Master с монтажной глубиной 70 мм для тихих неоживлённых улиц и помещений без отопления. Лучший выбор в виде окна,
							пропускающего
							больше естественного света.</p>
						<p>За экономную цену Вы получаете окно “Премиум”. Качественный тип профиля и стекла, который не подведет даже в самую суровую зиму, за
							счет
							морозостойкости! Сделано в России.</p>
					</div>
				</div>
				<div>
					<h4>Характеристики</h4>

					<ul>
						<li>Количество камер 3</li>
						<li>Толщина стенок 2.8 мм</li>
						<li>Толщина рамы 58 мм</li>
						<li>Толщина стеклопакета до 34 мм</li>
						<li>Цвет уплотнителя серый, черный</li>
					</ul>

					<div class="kbe-types__price">от 4 500 руб / м²</div>
				</div>
			</section>

			<section class="card kbe-types__item">
				<div>
					<img src="<?= get_theme_file_uri( 'assets/img/pages/kbe/kbe-engine.png' ); ?>" alt="">
					<div class="kbe-types__item-title">
						<h3>KBE Expert</h3>
						<p>В пластиковом окне EXPERT коэффициент сопротивления теплопередатке составляет 0.84 (0,78) м С / Вт. Пятикамерный профиль и
							качественное уплотнение не только способствуют снижению энергопотребления окон из профиля “Эксперт”, но и обеспечивают
							предотвращение образования паров на окнах после их монтажа!</p>
					</div>
				</div>
				<div>
					<h4>Характеристики</h4>

					<ul>
						<li>Количество камер 3</li>
						<li>Толщина стенок 2.8 мм</li>
						<li>Толщина рамы 58 мм</li>
						<li>Толщина стеклопакета до 34 мм</li>
						<li>Цвет уплотнителя серый, черный</li>
					</ul>

					<div class="kbe-types__price">от 5 350 руб / м²</div>
				</div>
			</section>

		</div>
	</div>
</section>