<?php

$items = [
	'Blitz'     => [
		'left'  => [
			[
				'title'       => 'Стекло толщиной 4 или 6 мм',
				'description' => 'Энергосберегающее или тонированное покрытие'
			],
			[
				'title'       => 'Однокамерный стеклопакет 32 мм',
				'description' => 'Достойная тепло и шумоизоляция'
			],
			[
				'title'       => 'Трехкамерная профильная система 60 мм',
				'description' => 'Инновационный и экологически безопасный профиль'
			],
		],
		'right' => [
			[
				'title'       => 'Уплотнительный контур',
				'description' => 'Защита от влаги и пыли, доступен в трех вариантах: черный, светло-серый, белый.'
			],
			[
				'title'       => 'Стальное замкнутое армирование',
				'description' => '1,5-2 мм с дополнительным ребром жесткости. Исключительная прочность и долговечность.'
			]
		],
		'price' => 2667
	],
	'Grazio'    => [
		'left'  => [
			[
				'title'       => 'Стекло толщиной 4 или 6 мм',
				'description' => 'Исполнение в различных вариантах.'
			],
			[
				'title'       => 'Стеклопакет 32 – 36 мм',
				'description' => 'Качественный теплопакет.'
			],
			[
				'title'       => 'Профиль 70 мм',
				'description' => 'Доступное решение с хорошими характеристиками.'
			],
		],
		'right' => [
			[
				'title'       => 'Уплотнительный контур',
				'description' => 'Изоляция и качественный внешний вид. Уплотнитель: черный, серый, белый.'
			],
			[
				'title'       => 'Стальное замкнутое армирование',
				'description' => 'Прочность и долговечность конструкции.'
			]
		],
		'price' => 2930
	],
	'Delight'   => [
		'left'  => [
			[
				'title'       => 'Стекло толщиной 4 или 6 мм',
				'description' => 'Прочные стекла с надежной защитой.'
			],
			[
				'title'       => 'Двухкамерный стеклопакет 36 мм',
				'description' => 'Защита помещения от теплопотерь.'
			],
			[
				'title'       => 'Пятикамерный профиль 70 мм',
				'description' => 'Современная и качественная профильная система.'
			],
		],
		'right' => [
			[
				'title'       => 'Уплотнительный контур',
				'description' => 'Стильный дизайн. Наличие дизайнерской створки с фигурным или закругленным штапиком.'
			],
			[
				'title'       => 'Стальное замкнутое армирование',
				'description' => 'Исключительная прочность и долговечность.'
			]
		],
		'price' => 3234
	],
	'Brilliant' => [
		'left'  => [
			[
				'title'       => 'Стекло толщиной 4 или 6 мм',
				'description' => 'Все виды.'
			],
			[
				'title'       => 'Cтеклопакет 36 мм',
				'description' => 'Максимум шумоизоляции и теплосбережения.'
			],
			[
				'title'       => '5-ти, шестикамерный профиль 70 мм и 80 мм',
				'description' => 'Профильная система премиум класса.'
			],
		],
		'right' => [
			[
				'title'       => 'Уплотнительный контур',
				'description' => 'Цвет уплотнителя на выбор: черный, серый, белый.'
			],
			[
				'title'       => 'Стальное замкнутое армирование',
				'description' => 'Устойчивость профиля к высоким нагрузкам.'
			]
		],
		'price' => 4370
	],
	'Intelio'   => [
		'left'  => [
			[
				'title'       => 'Стекло толщиной 4 или 6 мм',
				'description' => 'Все виды стекол.'
			],
			[
				'title'       => 'Cтеклопакет 44 мм и 52 мм',
				'description' => 'Максимум шумоизоляции и теплосбережения.'
			],
			[
				'title'       => 'Шестикамерный профиль 80 мм',
				'description' => 'Профиль премиум класса.'
			],
		],
		'right' => [
			[
				'title'       => 'Уплотнительный контур',
				'description' => 'Цвет уплотнителя на выбор: черный, серый, белый.'
			],
			[
				'title'       => 'Стальное замкнутое армирование',
				'description' => 'Устойчивость профиля к высоким нагрузкам.'
			]
		],
		'price' => 4792
	],
	'Geneo'     => [
		'left'  => [
			[
				'title'       => 'Стекло толщиной 4 или 6 мм',
				'description' => 'Все виды конфигураций.'
			],
			[
				'title'       => 'Cтеклопакет 44 мм и 52 мм',
				'description' => 'Максимум шумоизоляции и теплосбережения.'
			],
			[
				'title'       => 'Шестикамерный профиль 86 мм',
				'description' => 'Премиум класса.'
			],
		],
		'right' => [
			[
				'title'       => 'Уплотнительный контур',
				'description' => 'Цвет уплотнителя: серый.'
			],
			[
				'title'       => 'Стальное замкнутое армирование',
				'description' => 'Устойчивость профиля к высоким нагрузкам.'
			]
		],
		'price' => 5415
	]
];

$compare = [
	'Окна Rehau Blitz',
	'Окна Rehau Grazio',
	'Окна Rehau Delight',
	'Окна Rehau Brillant',
	'Количество камер профиля: 3',
	'Количество камер профиля: 3',
	'Количество камер профиля: 5',
	'Количество камер профиля: 5, 6',
	'Ширина профиля: 60 мм',
	'Ширина профиля: 70 мм',
	'Ширина профиля: 70 мм',
	'Ширина профиля: 70, 80 мм',
	'однокамерный 32 мм',
	'однокамерный 32-36 мм',
	'двухкамерный 36 мм',
	'двухкамерный 36 мм',
	'Ламинация: ☑️',
	'Ламинация: ☑️',
	'Ламинация: ☑️',
	'Ламинация: ☑️',
	'Цена: от 2 600 ₽',
	'Цена: от 2 650 ₽',
	'Цена: от 2 700 ₽',
	'Цена: от 2 900 ₽',
];

$result    = [];
$chunkSize = count( $compare ) / 6;

for ( $i = 0; $i < $chunkSize; $i ++ ) {
	for ( $j = 0; $j < 6; $j ++ ) {
		$result[ $i ][ $j ] = $compare[ $i + $chunkSize * $j ];
	}
}
?>

<div class="rehau">
	<div class="container">
		<p>Окна от немецкого бренда Рехау – лидер по установке в России и странах СНГ, их рекомендуют многие дизайнеры и мастера. Но почему этот производитель
			профиля так популярен на нашем рынке?</p>

		<p>К выбору окон, особенно в жилое помещение Российских регионов, стоит подходить серьезно и ответственно. Ведь именно они дают возможность наблюдать за
			улицей, проветривать помещение, при этом защищая строение от пыли, дождя, мороза, ветра, шума с улицы и сквозняка. Как раз наличие всех этих качеств
			выделяет окна Рехау от многих других фирм.</p>

		<p>Высокое качество и надежность окон Rehau обеспечиваются компанией за счет использования передовых разработок и применения проверенных материалов.
			Изделия данной фирмы тщательно тестируются в собственном исследовательском центре. Немаловажную роль сыграла и индивидуально разработанная заводом
			технология изготовления, которая значительно улучшила качество профиля.</p>
	</div>

	<section class="rehau-types">
		<div class="container">
			<h2 class="section__title">Типы окон Rehau</h2>

			<ul class="section-tabs">
				<li data-tab="panel-Blitz" class="--active">Blitz</li>
				<li data-tab="panel-Grazio">Grazio</li>
				<li data-tab="panel-Delight">Delight</li>
				<li data-tab="panel-Brilliant">Brilliant</li>
				<li data-tab="panel-Intelio">Intelio</li>
				<li data-tab="panel-Geneo">Geneo</li>
			</ul>

			<div class="rehau__panels">
				<?php foreach ( $items as $type => $item ) {

					$image = $type;

					if ( $type === 'Geneo' || $type === 'Intelio' ) {
						$image = 'Brilliant';
					}
					?>
					<section class="rehau__panel <?= $type === 'Blitz' ? '--active' : ''; ?>" id="panel-<?= $type; ?>">
						<div class="rehau__panel-left">
							<?php foreach ( $item['left'] as $item_left ) { ?>
								<div class="rehau__panel-item">
									<h5><?= $item_left['title']; ?></h5>
									<p><?= $item_left['description']; ?></p>
								</div>
							<?php } ?>
						</div>
						<div class="rehau__panel-image">
							<img src="<?= get_theme_file_uri( 'assets/img/pages/rehau/' . strtolower( $image ) . '.jpg' ); ?>" alt="<?= $type; ?>">
						</div>
						<div class="rehau__panel-right">
							<?php foreach ( $item['left'] as $item_right ) { ?>
								<div class="rehau__panel-item">
									<h5><?= $item_right['title']; ?></h5>
									<p><?= $item_right['description']; ?></p>
								</div>
							<?php } ?>

							<div class="rehau__panel-price">
								Цена: от <?= number_format( $item['price'], 0, '.', ' ' ); ?> руб / м²
							</div>
						</div>
					</section>
				<?php } ?>
			</div>
		</div>
	</section>

	<section class="rehau-advantages">
		<div class="container">
			<h2 class="section__title">Преимущества окон Rehau</h2>

			<div class="row">
				<div class="col-lg-12">
					<img src="<?php echo get_theme_file_uri( 'assets/img/pages/rehau/moroz.png' ); ?>" alt="">
					Прекрасные звуко- и теплоизоляционные данные, гарантирующие уют комнат. При проведении испытаний окон Rehau основной упор делается на
					достижение показателей звуко-, тепло-, гидроизоляции, предотвращение пыли и воздухопроницаемости, устойчивости к ветровым и механическим
					нагрузкам. В результате им удалось наладить производство профильных систем, обладающих защитными свойствами.
				</div>
				<div class="col-lg-12">
					<img src="<?php echo get_theme_file_uri( 'assets/img/pages/rehau/svet.png' ); ?>" alt="">
					Энергосберегающие, особенно, если подберется хороший стеклопакет. Особых успехов серии Rehau удалось достигнуть по показателям
					теплосбережения окон. Увеличенная толщина стенок профиля, многоконтурное уплотнение делают их идеальными для российского климата и защите от
					холода.
				</div>
				<div class="col-lg-12">
					<img src="<?php echo get_theme_file_uri( 'assets/img/pages/rehau/shhit.png' ); ?>" alt="">
					Доступная цена и качество конструкции. Абсолютно каждый сможет найти профиль, подходящий по бюджету, типу и техническим требованиям.
					Соотношение стоимости и технических характеристик у каждой модели от данного производителя действительно отличное. Многие отметили, что
					профиль от Рехау прочнее, чем у многих конкурентов.
				</div>
				<div class="col-lg-12">
					<img src="<?php echo get_theme_file_uri( 'assets/img/pages/rehau/okno.png' ); ?>" alt="">За счет фирменно разработанной
					фурнитуры, позволяет обеспечить отличное поворотно-откидное открывание.
				</div>
				<div class="col-lg-12">
					<img src="<?php echo get_theme_file_uri( 'assets/img/pages/rehau/remont.png' ); ?>" alt="">
					Даже самая недорогая и базовая комплектация профиля обеспечит надежный уровень сохранности от взлома.
				</div>
				<div class="col-lg-12">
					<img src="<?php echo get_theme_file_uri( 'assets/img/pages/rehau/rama.png' ); ?>" alt="">
					Не теряет свои полезные свойства со временем, не требуют особого ухода, ремонт и обслуживание, при этом долго сохраняя
					эстетичный внешний вид. Для того чтобы купленный профиль сохранял свою гладкость и белоснежный цвет, достаточно протирать 1 раз в год их
					обычным моющим. А для того, чтобы фурнитура работала без заведаний и проблем, достаточно смазывать ее 2 раза в год.
				</div>
				<div class="col-lg-12">
					<img src="<?php echo get_theme_file_uri( 'assets/img/pages/rehau/ekologiya.png' ); ?>" alt="">
					Использование безопасных материалов в производстве. Изготовление профиля осуществляется, не оставляя отходы и заботясь об
					экологии. Он не пахнет и при нагреве не выделяет опасных токсичных веществ для человека и окружающей среды.
				</div>
				<div class="col-lg-12">
					<img src="<?php echo get_theme_file_uri( 'assets/img/pages/rehau/zvuk.png' ); ?>" alt="">
					Отличная шумоизоляция. Звукоизоляция, особенно для зданий, находящихся рядом с проезжей частью, очень важный фактор.
					Любые специальные металлопластиковые окна от Rehau обладают подавлением шума с улицы, что позволит комфортно отдыхать и заниматься своими
					делами.
				</div>
				<div class="col-lg-12">
					<img src="<?php echo get_theme_file_uri( 'assets/img/pages/rehau/nepogoda.png' ); ?>" alt="">
					Устойчивость. Продукция соответствует ГОСТ и имеет знак европейского качества.
				</div>
				<div class="col-lg-12">
					<img src="<?php echo get_theme_file_uri( 'assets/img/pages/rehau/gryaz.png' ); ?>" alt="">
					Эстетичный, стильный и элегантный дизайн.
				</div>
			</div>
		</div>
	</section>

	<section class="rehau-compare">
		<div class="container">
			<h2 class="section__title">Сравнение систем Rehau</h2>
			<div class="row">
				<?php foreach ( $result as $item ) { ?>
					<div class="col-xl-6 col-md-12">
						<div class="rehau-compare__item">
							<img src="<?= get_theme_file_uri( 'assets/img/pages/rehau/rehau-okna.png' ); ?>" alt="">
							<ul>
								<?php foreach ( $item as $compareItem ) { ?>
									<li><?php echo $compareItem; ?></li>
								<?php } ?>
							</ul>
						</div>
					</div>
				<?php } ?>
			</div>
		</div>
	</section>
</div>